import { View, Text, ScrollView } from "react-native";

const Policy = () => {
  return (
    <View className="flex-1 bg-primary">
      <ScrollView
        className="mx-auto w-full max-w-xl"
        contentContainerStyle={{ padding: 24 }}
        showsVerticalScrollIndicator={false}
        automaticallyAdjustContentInsets={false}
        contentInset={{ top: 12 }}
      >
        <Text className="text-2xl font-bold text-white mb-6 text-start">
          Общи условия
        </Text>

        <View className="bg-gray-800 rounded-2xl p-5 mb-8 shadow-sm shadow-orange-400">
          <Text className="text-lg font-semibold text-gray-100 mb-2">
            Политика за използване на бисквитки (Cookie Policy)
          </Text>
          <Text className="text-base text-gray-300 whitespace-pre-line">
            Сайтът на Щастлив Свят използва бисквитки, които са важни за
            коректната му работа. Посещавайки нашия сайт, Вие приемате
            използването на бисквити. Основание за събиране, обработване и
            съхраняване на Вашите лични данни Видове бисквитки, които
            използваме: Задължителни бисквитки Тези бисквитки са необходими за
            коректната работа на уебсайта. Например, с тези бисквитки ви
            показваме информацията на нашия сайт на правилния език, показваме Ви
            онлайн чат и подобряваме функционалността на уебсайта ни. Аналитични
            бисквитки Този тип бискитки ни помагат да подобряваме уебсайта си
            като анализираме как потребителите го използват (бисквитки на Google
            Analytics). Тези бисквитки не ни дават никаква информация за вашите
            лични данни. Те ни предоставят анонимна обобщена информация за това
            как нашия уебсайт се ползва - например, кои страници от сайта ни сте
            разгледали, дали сте посетили сайта ни през мобилно или десктоп
            устройство и други. Функционални бисквитки Tези бисквитки спомагат
            за използване на цялата функционалност на сайта ни: например да
            гледате видеата в него, както и да използвате онлайн чата ни.
            Настройките на бисквитките, можете да промените в браузъра, който
            използвате. Имайте предвид, че ако ограничите някои видове
            бисквитки, е възможно сайтът ни да не работи напълно коректно и да
            не можете да използвате пълните му функционалности.
          </Text>
        </View>
        <View className="bg-gray-800 rounded-2xl p-5 mb-8 shadow-sm shadow-orange-400">
          <Text className="text-lg font-semibold text-gray-100 mb-2">
            Задължителна информация за правата на лицата по защита на личните
            данни (Privacy notice)
          </Text>
          <Text className="text-base text-gray-300 whitespace-pre-line">
            Информация относно Администратора на лични данни Наименование
            Щастлив Свят ЕООД ЕИК/Булсат: 202786792 Седалище и адрес на
            управление: гр. София, р-н Средец, ул.Славянска №19 Адрес за
            упражняване на дейността: гр. София, кв. Студентски Град, ул. "проф.
            Георги Брадистилов" №3 Данни за кореспонденция: гр. София, кв.
            Студентски Град, ул. "проф. Георги Брадистилов" №3 E-mail:
            info@happyworld.bg Телефон.: +359 89 0315455 Информация относно
            компетентния надзорен орган Наименование: Комисия за защита на
            личните данни Седалище и адрес на управление: гр. София 1592, бул.
            „Проф. Цветан Лазаров” № 2 Данни за кореспонденция: гр. София 1592,
            бул. „Проф. Цветан Лазаров” № 2 Телефон: 02 915 3 518 Email:
            kzld@government.bg, kzld@cpdp.bg Уеб сайт: https://cpdp.bg Щастлив
            Свят ЕООД осъществява дейността си в съответствие със Закона за
            защита на личните данни и Регламент (ЕС) 2016/679 на Европейския
            парламент и на Съвета от 27 април 2016 година относно защитата на
            физическите лица във връзка с обработването на лични данни и относно
            свободното движение на такива данни.
          </Text>
        </View>
      </ScrollView>
    </View>
  );
};

export default Policy;
